tutorials/verificationAndValidation/axisymmetricHemispherical/sim/interPlicPhaseChangeFoam/cavNum04/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "./system/geometryAndMeshDimensions"

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    bodySide.stl
    {
        type                triSurfaceMesh;
        name                bodySide;
        appendRegionName    false;
    }

    bodyTop.stl
    {
        type                triSurfaceMesh;
        name                bodyTop;
        appendRegionName    false;
    }

    inlet.stl
    {
        type                triSurfaceMesh;
        name                inlet;
        appendRegionName    false;
    }

    outlet.stl
    {
        type                triSurfaceMesh;
        name                outlet;
        appendRegionName    false;
    }

    side.stl
    {
        type                triSurfaceMesh;
        name                side;
        appendRegionName    false;
    }

    refinement1
    {
        type                sphere;
        origin              (0.0125 0 0);
        radius              0.04;
    }

    refinement2
    {
        type                cylinder;
        point1              (0.0125 0 0);
        point2              (   0.2 0 0);
        radius              0.04;
    }
};

castellatedMeshControls
{
    maxLocalCells               100000000;
    maxGlobalCells              400000000;
    minRefinementCells          0;
    nCellsBetweenLevels         1;
    maxLoadUnbalance            0.1;
    allowFreeStandingZoneFaces  true;
    resolveFeatureAngle         10.0;
    planarAngle                 30.0;

    features
    (
        {
            file                    bodySide.extendedFeatureEdgeMesh;
            levels                  (( 0 0 ));
            refineFeatureEdgesOnly  false;
        }

        {
            file                    bodyTop.extendedFeatureEdgeMesh;
            levels                  (( 0 0 ));
            refineFeatureEdgesOnly  false;
        }

        {
            file                    inlet.extendedFeatureEdgeMesh;
            levels                  (( 0 0 ));
            refineFeatureEdgesOnly  false;
        }

        {
            file                    outlet.extendedFeatureEdgeMesh;
            levels                  (( 0 0 ));
            refineFeatureEdgesOnly  false;
        }

        {
            file                    side.extendedFeatureEdgeMesh;
            levels                  (( 0 0 ));
            refineFeatureEdgesOnly  false;
        }
    );

    refinementSurfaces
    {
        bodySide
        {
            level ( $wallLevel $wallLevel );
        }

        bodyTop
        {
            level ( $wallLevel $wallLevel );
        }

        inlet
        {
            level ( 0 0 );

            patchInfo
            {
                type patch;
            }
        }

        outlet
        {
            level ( 0 $wallLevel );

            patchInfo
            {
                type patch;
            }
        }

        side
        {
            level ( 0 0 );
        }
    }

    refinementRegions
    {
        refinement1
        {
            mode inside;
            levels ((0 $wallLevel));
        }

        refinement2
        {
            mode inside;
            levels ((0 $wallLevel));
        }
    }

    locationInMesh  ( -0.1 0.051 0.051 ) ;
}

snapControls
{
    tolerance               2;
    implicitFeatureSnap     false;
    explicitFeatureSnap     true;
    multiRegionFeatureSnap  true;
    detectNearSurfacesSnap  true;
    nSmoothPatch            3;
    nSolveIter              50;
    nRelaxIter              5;
    nFeatureSnapIter        10;
    nSmoothInternal         3;
    nFaceSplitInterval      15;
}

addLayersControls
{
    relativeSizes               true;
    expansionRatio              1.15;
    firstLayerThickness         0.2;
    //finalLayerThickness         0.2;
    minThickness                0.01;
    nGrow                       0;
    featureAngle                180.0;
    slipFeatureAngle            10.0;
    nRelaxIter                  10;
    nSmoothSurfaceNormals       5;
    nSmoothNormals              3;
    nSmoothThickness            10;
    maxFaceThicknessRatio       0.5;
    maxThicknessToMedialRatio   0.3;
    minMedialAxisAngle          90;
    nBufferCellsNoExtrude       0;
    nLayerIter                  50;
    nRelaxedIter                20;
    mergePatchFacesAngle        5.0;
    concaveAngle                10.0;
    layerTerminationAngle       -180;

    layers
    {
        bodySide
        {
            nSurfaceLayers      $nLayers;
            //expansionRatio      1.2;
            //firstLayerThickness 0.1;
        }

        bodyTop
        {
            nSurfaceLayers      $nLayers;
            //expansionRatio      1.2;
            //firstLayerThickness 0.1;
        }
    }
}

meshQualityControls
{
    minVol              1e-13;
    minTetQuality       1e-16;
    minArea             1e-13;
    minTwist            0.05;
    minDeterminant      1e-06;
    minFaceWeight       0.02;
    minVolRatio         0.01;
    minTriangleTwist    -1;
    minFlatness         0.5;
    maxNonOrtho         60.0;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    nSmoothScale        4;
    errorReduction      0.75;

    relaxed
    {
        minVol              1e-30;
        minTetQuality       1e-30;
        minArea             1e-30;
        minTwist            0.001;
        minDeterminant      1e-06;
        minFaceWeight       1e-06;
        minVolRatio         0.01;
        minTriangleTwist    -1;
        minFlatness         0.5;
        maxNonOrtho         75;
        maxBoundarySkewness 20;
        maxInternalSkewness 8;
        maxConcave          80;
        nSmoothScale        4;
        errorReduction      0.75;
    }
}

//writeFlags      ( scalarLevels );

mergeTolerance  1e-08;

debug           0;


// ************************************************************************* //
